Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: Advice About Using wxString
ja: wxStringを使用するにあたってのアドバイス

source: After having enumerated all the functions which are normally used to log the messages, and why would you want to use them we now describe how all this works.
ja: メッセージのロギングに通常使用するすべての関数と、それらを使用する理由について列挙したので、これらの動作方法について説明します。

source: After having enumerated all the functions which are normally used to log the messages, and why would you want to use them, we now describe how all this works.
ja: メッセージのロギングに通常使用するすべての関数と、それらを使用する理由について列挙したので、これらの動作方法について説明します。

source: Again, the best way to ensure that this problem doesn't arise is to rebuild your code using a compiler which warns about function signature mismatch (you can use -Woverloaded-virtual g++ option).
ja: 繰り返しますが、この問題が発生しないようにする最良の方法は、関数のシグネチャの不一致を警告するコンパイラでリビルドすることです。(これには -Woverloaded-virtual g++ オプションを使用できます。)

source: Again, this mostly will be unnoticeable but can result in some problems:
ja: これはほとんど目立ちませんが、いくつかの問題を引き起こすことがあります:

source: All wxTextCtrl methods
ja: wxTextCtrl のすべての関数

source: All children are given the same size, which is the minimal size required by the biggest child, in this case the text control in the left bottom border.
ja: 子コントロールはすべて同じサイズ (最大の子コントロールの必要とする最小サイズ) が与えられます。この例では左下のテキストコントロールが最大の子コントロールです。

source: All considerations for wxObject-derived reference counted objects are valid also for wxString, even if it does not derive from wxObject.
ja: wxString は wxObject を継承していませんが、wxObject を継承した 参照カウント オブジェクトと同様のことが wxString にも当てはまります。

source: All formats that are supported by the wxImage class.
ja: wxImage クラスの対応するすべての形式

source: All of them have the same syntax as printf() or vprintf() , i.e. they take the format string as the first argument and respectively a variable number of arguments or a variable argument list pointer.
ja: これらの関数はすべて printf() や vprintf() と同じ構文を持ちます。つまり、第一引数にフォーマット文字列を取り、続けて可変引数か可変引数リストのポインタを取ります。

source: All sizers are containers, that is, they are used to lay out one dialog item (or several dialog items), which they contain.
ja: サイザーはすべてコンテナです。つまり、ひとつ (または複数) のダイアログアイテムを内部に配置するために使用されます。

source: All strings in the catalog are encoded using this charset.
ja: カタログ内のすべての文字列はこの文字コードで符号化されています。

source: All the children apart from standard buttons are reparented onto a new wxScrolledWindow object, using the old top-level sizer for the scrolled window and creating a new top-level sizer to lay out the scrolled window and standard button sizer.
ja: 標準ボタン以外のすべての子コントロールの親は新しい wxScrolledWindow オブジェクトに変更されます。このとき、以前のトップレベルサイザーはスクロール可能なウィンドウに使用され、スクロール可能なウィンドウと標準ボタンサイザーを配置するために新しいトップレベルサイザーが作成されます。

source: All the details about how to use them may be found in the description of the wxConfigBase class and the documentation of the file, registry and INI file based implementations mentions all the features/limitations specific to each one of these versions.
ja: 使用方法についての詳細は wxConfigBase クラスの説明の中で記載しています。また、ファイル、レジストリ、INI ファイルベースの実装についてのドキュメントでは、それぞれのバージョン独自の機能/制限について触れています。

source: All validator classes must implement the Clone() function, which returns an identical copy of itself...
ja: すべてのバリデータクラスは自身と同一なコピーを返却する Clone() 関数を実装する必要があります。

source: All wxWidgets functions, such as wxPrintf(), wxLogMessage() &c still work with it, but passing it to printf() will now result in a crash.
ja: wxPrintf()、wxLogMessage() など、すべての wxWidgets 関数は引き続き動作しますが、printf() にこの戻り値を渡すとプログラムがクラッシュするでしょう。

source: All wxWidgets platforms support XPMs for small bitmaps and icons.
ja: 小さなビットマップやアイコンに使用される XPM について、wxWidgets はすべてのプラットフォームで対応しています。

source: All you need to do is override the MB2WC and WC2MB methods.
ja: 必要なことは MB2WC 関数と WC2MB 関数をオーバーライドすることだけです。

source: Allocating more memory may bring important performance benefits for programs using (relatively) few very long strings.
ja: より多くのメモリを割り当てることで、(相対的に) とても長い文字列を使用するプログラムでは性能が大きく向上することでしょう。

source: Allocating too much extra memory would help to improve the speed in this situation, but due to a great number of wxString objects typically used in a program would also increase the memory consumption too much.
ja: この場合では余分なメモリを割り当てることで処理速度が改善されましたが、通常のプログラムでは非常に多くの wxString が使用されるため、メモリ消費量も大きく増加します。

source: Allows the programmer to specify whether the application will exit when the top-level frame is delete...
ja: トップレベルウィンドウが削除されたときにアプリケーションを終了するかどうかをユーザが指定することができます。

source: Allows you to add a custom event table entry by specifying the event identifier (such as wxEVT_SIZE), the window identifier, and a member function to call.
ja: (wxEVT_SIZE といった) イベント識別子、ウィンドウ識別子、呼び出すメンバ関数を指定してカスタムイベントのエントリをイベントテーブルへ追加することができます。

source: Almost last but very, very far from least is the increased flexibility which allows to bind an event to:
ja: 大事なことを一つ言い残しましたが、バインド対象についても柔軟性が向上しており、イベントを以下のものにバインドできます:

source: Also note that if all string arguments to your functions are passed as const wxString& (see the section Some advice) this situation will almost never arise because for constant references the correct operator is called automatically.
ja: また、関数の引数の文字列をすべて const wxString& で受け取っている場合 (アドバイス の章を参照)、この問題がほとんど発生しないことに注意してください。なぜなら、const 参照に対しては自動的に正しい演算子が呼ばれるためです。

source: Also notice that wxLog::EnableLogging() and wxLogNull class which uses it only affect the current thread, i.e. logging messages may still be generated by the other threads after a call to EnableLogging(false).
ja: また、wxLog::EnableLogging() と wxLogNull クラスは現在のスレッドにのみ影響することに注意してください。つまり、EnableLogging(false) を呼んだ後でも他のスレッドでは依然としてログメッセージが生成されます。

source: Also notice that in spite of the availability of these functions, wxString is not the ideal class for storing arbitrary binary data as they can take up to 4 times more space than needed (when using wchar_t internal representation on the systems where size of wide characters is 4 bytes) and you should consider using wxMemoryBuffer instead.
ja: また、これらの関数が存在しているにも関わらず、任意のバイナリデータを格納するのに wxString は理想的なクラスとは言えないことに注意してください。なぜなら、必要とされる量の最大 4 倍の領域を消費する (ワイド文字が 4 バイトのシステムで内部表現に wchar_t を使用するときがこれに該当します) ためです。代わりに wxMemoryBuffer を使用することを検討してください。

source: Also notice that most of the existing wxWidgets tutorials and discussions use the event tables because they historically preceded the apparition of dynamic event handling in wxWidgets.
ja: 既存の wxWidgets のチュートリアルや議論の大半ではイベントテーブルを使用していることにも注意してください。これは歴史的に、wxWidgets で動的イベント処理が可能になる前から、それらの文書が存在するためです。

source: Also please notice that there are additional steps in the event handling for the windows-making part of wxWidgets document-view framework, i.e., wxDocParentFrame, wxDocChildFrame and their MDI equivalents wxDocMDIParentFrame and wxDocMDIChildFrame.
ja: また、wxWidgets ドキュメント/フレームワークのウィンドウ部分、つまり、wxDocParentFrame、wxDocChildFrame と、その MDI 版である wxDocMDIParentFrame、wxDocMDIChildFrame でのイベント処理には追加のステップが存在することにも注意してください。

source: Also, the hhp project file needs one additional line in the OPTIONS section:
ja: また、hhp プロジェクトファイルの OPTIONS セクションに一行追加する必要があります:

source: Also, the string and character constants should be encoded using wide characters (wchar_t type) which typically take 2 or 4 bytes instead of char which only takes one.
ja: また、文字列や文字定数は char (1 バイト) の代わりにワイド文字 (wchar_t 型、通常 2 か 4 バイト) で符号化される必要があります。

source: Alternatively, you may derive from wxTextDropTarget or wxFileDropTarget and override their OnDropText() or OnDropFiles() method.
ja: もしくは、wxTextDropTarget や wxFileDropTarget を継承し、それらのクラスの OnDropText() 関数や OnDropFiles() 関数をオーバーライドするようにしてください。

source: Alternatively, you may use -a option to extract all the strings, but it will usually result in many strings being found which don't have to be translated at all.
ja: 代わりに -a オプションを使用することもできますが、そうするとまったく翻訳する必要のない文字列が大量に見つかることになるでしょう。

source: Although everything works fine inside the program, things can get nasty when it tries to communicate with the outside world which, sadly, often expects ANSI strings (a notable exception is the entire Win32 API which accepts either Unicode or ANSI strings and which thus makes it unnecessary to ever perform any conversions in the program).
ja: プログラム内部ではすべてうまく動作するとしても、外部の世界とやり取りしようとすると、それらは悲しいことにしばしば ANSI 文字列を想定しているため、ひどいことになります。 (特筆すべき例外として、すべての Win32 API は Unicode 文字列と ANSI 文字列の両方を受け付けるため、プログラム内でなんらかの変換を行う必要がまったくありません）

source: Although internationalization of an application (i18n for short) involves far more than just translating its text messages to another message - date, time and currency formats need changing too, some languages are written left to right and others right to left, character encoding may differ and many other things may need changing too - it is a necessary first step.
ja: アプリケーションの国際化 (略して i18n) には単にテキストメッセージを他のメッセージに翻訳すること以上のことが含まれます。日付や時間、通貨の形式も変更する必要がありますし、ある言語は左から右へ、別の言語では右から左へ表記するでしょう。文字コードも異なりますし、他にもたくさんのことを変更する必要がありますが、これは必要な最初のステップです。

source: Although it works just fine under Unix, these messages go strictly nowhere under Windows where the stdout of GUI programs is not assigned to anything.
ja: ただし、これは Unix では正常に動作しますが、GUI プログラムの標準出力がどこにも割り当てられない Windows では厳密にどこにも出力されません.

source: Although the implicit conversion to C strings is applied automatically by the compiler in the case of
ja: 次のような場合であれば、コンパイラによって自動的に C 文字列への暗黙的な変換が行われます。

source: Always enclose literal string constants in wxT() macro unless they're already converted to the right representation (another standard wxWidgets macro _() does it, for example, so there is no need for wxT() in this case) or you intend to pass the constant directly to an external function which doesn't accept wide-character strings.
ja: リテラル文字列をすでに正しい表現に変換している (例えば、別の標準 wxWidgets マクロ _() も wxT() と同じ事を行うため、この場合は wxT() を使う必要はありません) か、ワイド文字列を受け付けない外部関数へ直接リテラル文字列を渡すのでない限り、リテラル文字列は常に wxT() で囲む

source: Always use wxChar instead of char
ja: char の代わりに常に wxChar を使用する

source: An application closes by destroying all windows.
ja: アプリケーションはすべてのウィンドウを破棄することで終了します。

source: An arbitrary functor like boost::function<>.
ja: boost::function<> のような任意のファンクタ。

source: An enumeration for formats .
ja: フォーマット用の列挙型。

source: An erase background event
ja: 背景の消去イベント

source: An event is a structure holding information about an event passed to a callback or member function...
ja: wxEvent はコールバック関数かメンバ関数に渡されるイベントの情報を格納した構造体です。

source: An event table is placed in an implementation file to tell wxWidgets how to map events to member functions.
ja: イベントテーブルはソースファイルに配置され、wxWidgets にイベントとメンバ関数のマッピング方法を知らせます。

source: An example of defining an application follows:
ja: アプリケーションを定義する例は以下の通りです:

source: An icon is a small rectangular bitmap usually used for denoting a minimized application.
ja: アイコンは小さな矩形のビットマップで、最小化されたアプリケーションを表すためによく使用されます。

source: An idle event
ja: アイドルイベント

source: An ordinary function like a static method or a global function.
ja: 静的関数やグローバル関数のような普通の関数。

source: Anatomy of a Validator
ja: バリデータの構造

source: Anatomy of a validator
ja: バリデータの構造

source: And all components are children of the unnamed root component.
ja: そして、すべてのコンポーネントは無名のルートコンポーネントの子になります。

source: And as with wxString::FromUTF8() example above, you can always use wxString::ToUTF8() to retrieve the string contents in UTF-8 encoding -- this, unlike converting to char* using the current locale, never fails.
ja: また、上の wxString::FromUTF8() を使ったサンプルのように、UTF-8 で符号化された文字列を取得するために常に wxString::ToUTF8() を使うことができます。この方法は、現在のロケールを使用して char* に変換する方法と比較して、変換に失敗することがありません。

source: And finally you can bind to an arbitrary functor and use it as an event handler:
ja: そして、最後に任意のファンクタをバインドし、イベントハンドラとして使用することができます:

source: And finally, the standard preprocessor tokens enumerated above expand to ANSI strings but it is more likely that Unicode strings are wanted in the Unicode build.
ja: 最後に、上に挙げた標準プリプロセッサトークンは ANSI 文字列として展開されますが、Unicode ビルドの際には Unicode 文字列の方が必要なことが多いでしょう。

source: And the answer is that:
ja: そして、その答えは次の通りです:

source: And the very last string-related class is wxArrayString: it is just a version of the "template" dynamic array class which is specialized to work with strings.
ja: そして、文字列に関する最後のクラスが wxArrayString です: これは単なる "テンプレート" 動的配列クラスの一種で、文字列に対して使用するように特殊化されています。

source: And this is what the wxMBConv classes do.
ja: そしてこれこそが wxMBConv クラスの行なうことです。

source: And while the events are normally generated by wxWidgets itself, you can also do this, which is especially useful when using custom events (see Custom Event Summary).
ja: また、通常、イベントは wxWidgets 自身によって生成されますが、あなたがこれを行うことも可能です。これはカスタムイベントを使用する場合に特に有用です。 (カスタムイベントの概要 参照)

source: Another aspect of the application shutdown is OnExit which is called when the application exits but before wxWidgets cleans up its internal structures.
ja: アプリケーションの終了の別の側面は OnExit です。この関数はアプリケーションの終了時に呼ばれますが、wxWidgets の内部構造が破棄される前に呼ばれます。

source: Another aspect of the application shutdown is wxApp::OnExit which is called when the application exits but before wxWidgets cleans up its internal structures.
ja: アプリケーションの終了の別の側面は wxApp::OnExit です。この関数はアプリケーションの終了時に呼ばれますが、wxWidgets の内部構造が破棄される前に呼ばれます。

source: Another class of problems is related to the fact that the value returned by c_str() itself is also not just a pointer to a buffer but a value of helper class wxCStrData which is implicitly convertible to both narrow and wide strings.
ja: 発生しうる別の問題は c_str() 自身の返却する値もまたバッファのポインタではなく、暗黙的にナロー文字列やワイド文字列へ変換可能なヘルパークラス wxCStrData であることに関連しています。

source: Another possibility which exists now is to provide an overload of wxToString() (and wxFromString()) for your own type, e.g.
ja: 別の方法としては、独自の型用に wxToString() (と wxFromString()) をオーバーロードすることです。

source: Another two-dimensional sizer derived from wxGridSizer.
ja: wxGridSizer を継承した別の 2 次元サイザーです。

source: Another very widespread standard is UTF-16 which is used by Microsoft Windows: it encodes the first (approximately) 64 thousands of Unicode code points (the BMP plane) using 16-bit code units (2 bytes) and uses a pair of 16-bit code units to encode the characters beyond this.
ja: 非常に広く使われている別の規格として、Microsoft Windows で使われている UTF-16 があります。これは最初の約 64,000 個の Unicode コードポイント (基本多言語面) を 16 ビット (2 バイト) のコード単位で符号化し、それ以降の文字は 16 ビットのコード単位の組で符号化します。

source: Another, similar, alternative is to use pointer arithmetic:
ja: 別の方法としては、ポインタ計算を使う方法があります:

source: Any character may have one or more glyph associated; e.g. some of the possible glyphs for the capital letter 'A' are:
ja: どの文字も 1 つまたは複数のグリフと関連付けられています; 例えば、大文字の 'A' であれば以下のようなグリフが関連付けられているかもしれません

source: Any wxWidgets function accepts arguments of either type as both kinds of strings are implicitly converted to wxString, so both
ja: どの wxWidgets 関数も引数を暗黙的に wxString へ変換するため、どちらの型でも受け付けます。

source: Apart from defining your event class, you also need to define your own event table macro if you want to use event tables for handling events of this type.
ja: イベントクラスの定義とは別に、独自のイベントテーブルマクロも定義する必要があります。

source: Apart from defining your event class, you will also need to define your own event table macro (which is quite long).
ja: イベントクラスの定義とは別に、独自のイベントテーブルマクロも定義する必要があります。 (そしてこれは非常に長くなります)

source: Appends a child to the sizer.
ja: サイザーに子コントロールを追加します。

source: Application Shutdown
ja: アプリケーションの終了

source: Application shutdown
ja: アプリケーションの終了

source: As a convenience, wxDialog::CreateButtonSizer(long flags) can be used to create a standard button sizer in which standard buttons are displayed.
ja: 利便性のために、標準的なボタンを表示する標準ボタンサイザーを作成するのに CreateButtonSizer (long フラグ) を使用できます。

source: As a convenience, CreateButtonSizer ( long flags ) can be used to create a standard button sizer in which standard buttons are displayed.
ja: 利便性のために、標準的なボタンを表示する標準ボタンサイザーを作成するのに CreateButtonSizer (long フラグ) を使用できます。

source: As a slight extension of the above, the handlers can also be unbound at any time with Unbind<>() (and maybe rebound later).
ja: この延長として、Unbind<>() を使ってイベントハンドラのバインディングを任意のタイミングで解除することもできます。 (また、あとから再バインドするかもしれません)

source: As an event type is a variable, it can also be declared using wxDECLARE_EVENT() if necessary.
ja: イベント型は変数なので、必要であれば wxDECLARE_EVENT() を使用して宣言することもできます。

source: As an ever greater variety of mobile hardware comes to market, it becomes more imperative for wxWidgets applications to adapt to these platforms without putting too much burden on the programmer.
ja: 様々なモバイル端末が市場に出回るにつれ、プログラマに過度の負担をかけることなく、アプリケーションをそれらのプラットフォームへ適応させることが wxWidgets に求められるようになってきました。

source: As an example, trying to open a non-existing file will usually provoke an error message, but if for some reasons it is unwanted, just use this construction:
ja: 例として、存在しないファイルを開こうとすると通常はエラーメッセージが表示されますが、何らかの理由でそれを望まない場合、次のようにするだけです:

source: As an example, we will construct a dialog that will contain a text field at the top and two buttons at the bottom.
ja: 例として、上部にテキストフィールドを持ち、下部にふたつのボタンを持つダイアログを構築します。

source: As each event is uniquely defined by its event type, defining a custom event starts with defining a new event type for it.
ja: 各イベントはイベント型によって一意に定義されるため、カスタムインベントは新しいイベント型を定義するところから始まります。

source: As for the (real) trace messages, their handling depends on the currently enabled trace masks: if wxLog::AddTraceMask() was called for the mask of the given message, it will be logged, otherwise nothing happens.
ja: (本当の) トレースメッセージについては、現在有効になっているトレースマスクに応じて処理が行われます: 指定されたメッセージのマスクに対して wxLog::AddTraceMask() が呼ばれている場合はメッセージが記録されますが、そうでない場合は何も起こりません。

source: As it is common to have more than one object generating events of the same type (e.g. a typical window contains several buttons, all generating the same button click event), checking the event source object or its id allows to distinguish between them.
ja: 複数のオブジェクトが同じ型のイベントを生成すること (例えば、一般的なウィンドウは複数のボタンを持ちますが、それらはすべて同じボタンクリックイベントを生成します) はよくあるため、イベントの生成元オブジェクトやその識別子を確認することで生成元を区別することができます。

source: As it is easy to see comparing the last fragment with the one above, this macro expands to nothing in the (usual) ANSI mode and prefixes 'L' to its argument in the Unicode mode.
ja: 最後の部分を上記の例と比較すると簡単に分かるように、このマクロは (通常の) ANSI モードでは何も起こりませんが、Unicode モードでは引数の接頭語 'L' として展開されます。

source: As mentioned above most controls will also set this size value as the control's min size.
ja: 上で述べたように、ほとんどのコントロールではこのサイズがコントロールの最小サイズとしても使用されます。

source: As mentioned above most controls will also set this size value as the control's minimal size.
ja: 上で述べたように、ほとんどのコントロールではこのサイズがコントロールの最小サイズとしても使用されます。

source: As mentioned above, any window belonging to a sizer may have a border, and it can be specified which of the four sides may have this border, using the wxTOP, wxLEFT, wxRIGHT and wxBOTTOM constants or wxALL for all directions (and you may also use wxNORTH, wxWEST etc instead).
ja: 上で述べたように、サイザーに所属するウィンドウはどれもボーダーを持ち、四方向のどの方向にボーダーを持たせるか指定することができます。これには wxTOP、wxLEFT、wxRIGHT、wxBOTTOM 定数か、全方向を表す wxALL を使用します。 (代わりに wxNORTH、wxWEST などを使用することも可能です)

source: As mentioned above, any window belonging to a sizer may have border, and it can be specified which of the four sides may have this border, using the wxTOP, wxLEFT, wxRIGHT and wxBOTTOM constants or wxALL for all directions (and you may also use wxNORTH, wxWEST etc instead).
ja: 上で述べたように、サイザーに所属するウィンドウはどれもボーダーを持ち、四方向のどの方向にボーダーを持たせるか指定することができます。これには wxTOP、wxLEFT、wxRIGHT、wxBOTTOM 定数か、全方向を表す wxALL を使用します。 (代わりに wxNORTH、wxWEST などを使用することも可能です)

source: As mentioned above, only command events are recursively applied to the parents event handler in the library itself.
ja: 上で述べたように、コマンドイベントだけが親コントロールのイベントハンドラで再帰的に処理されます。

source: As mentioned above, the events of the classes deriving from wxCommandEvent are propagated by default to the parent window if they are not processed in this window itself.
ja: 以前述べたように、wxCommandEvent を継承したクラスのイベントは、ウィンドウ自身で処理されなかった場合にデフォルトで親ウィンドウまで伝播します。

source: As mentioned above, under Unix systems wxString class can use variable-width UTF-8 encoding for internal representation.
ja: 上で述べたように、Unix システムでは wxString クラスの内部表現に可変長の UTF-8 を使用することができます。

source: As mentioned before, all event handlers take a wxEvent-derived argument whose exact class differs according to the type of event and the class of the originating window.
ja: 以前述べたように、すべてのイベントハンドラは wxEvent を継承した引数を取りますが、その引数のクラスはイベントの型と発生元ウィンドウのクラスに応じて異なります。

source: As mentioned before, the member functions that handle events do not have to be virtual.
ja: 前に述べたように、イベントを処理するメンバ関数は仮想関数である必要はありません。

source: As most programs use character strings, the standard C library provides quite a few functions to work with them.
ja: 多くのプログラムで文字列が使用されていますが、標準 C ライブラリではそれらのプログラムで使用できる関数をほんの少ししか提供していません。

source: As not all platforms supported by wxWidgets support Unicode (fully) yet, in many cases it is unwise to write a program which can only work in Unicode environment.
ja: wxWidgets の対応しているすべてのプラットフォームで Unicode が (完全に) サポートされているわけではないため、Unicode 環境でのみ動作するプログラムを書くのは多くの場合で賢明ではないでしょう。

source: As previously described, when wxUSE_UNICODE_UTF8==1, wxString internally uses the variable-length UTF8 encoding.
ja: 前に述べたように、wxUSE_UNICODE_UTF8==1 の場合に wxString は可変長の UTF-8 エンコーディングを内部的に使用します。

source: As programs are becoming more and more globalized, and users exchange documents across country boundaries as never before, applications increasingly need to take into account all the different character sets in use around the world.
ja: プログラムがよりグローバル化し、かつてないほどユーザが国境を超えてドキュメントをやり取りするようになるにつれ、世界中で使用されているすべての文字コードについて考慮することがますます求められるようになりました。

source: As reinforced in the next section, calling Close does not guarantee that the window will be destroyed.
ja: 次の章で補足しますが、Close の呼び出しはウィンドウが破棄されることを保証しません。

source: As such, it implements the virtual functions of the base class which are called when a message is logged.
ja: そのため、メッセージのロギング時に呼ばれる基底クラスの仮想関数を実装ています。

source: As the call to this operator may modify the string, its data is unshared (COW is done) and so if the string was really shared there is some performance loss (both in terms of speed and memory consumption).
ja: この演算子を呼び出すことで文字列が変更されるため、データは共有されなくなります。(COW が行われます) そのため、文字列が本当に共有されていた場合、いくらか性能が (速度とメモリ消費の両方の観点で) 劣化します。

source: As this quite often causes confusion for users, here is a list of system events which will NOT get sent to the parent's event handler:
ja: このことについて混乱する人が多いため、親コントロールのイベントハンドラへ送信 "されない" システムイベントの一覧を以下に示します。

source: As this solution is obviously preferable to the previous ones (think of incompatible encodings for the same language, locale chaos and so on), many modern operating systems support it.
ja: この解決策は明らかにこれまでのものより望ましい (同じ言語の互換性のない文字コード、混沌としたロケールなどを想像してみてください) ため、多くのモダンなオペレーティングシステムでは Unicode をサポートしています。

source: As usual, the accent is put on cross-platform features which explains, for example, the wxTextFile class which may be used to convert between different types of text files (DOS/Unix/Mac).
ja: いつものように、クロスプラットフォーム機能に重点がおかれています。例えば wxTextFile クラスでは異なる形式 (DOS/Unix/Mac) のテキストフアイル同士を変換するために使用されます。

source: As visual aid to understand the differences between the various concepts described so far, look at the different UTF representations of the same code point:
ja: 今までに述べたコンセプトの違いを理解するため、同じコードポイントにおける UTF の表現方法の違いを見てください。

source: As well as the event table in the implementation file, there must also be a DECLARE_EVENT_TABLE macro somewhere in the class declaration.
ja: イベントテーブルをソースファイルに配置するように、クラス宣言のどこかに DECLARE_EVENT_TABLE マクロを配置しなければなりません。

source: As you can see, UTF16 encoding is straightforward (for characters in the BMP) and in this example the UTF16-encoded wxString takes 8 bytes.
ja: 見て分かるように、UTF16 は (BMP の文字については) そのまま符号化しており、この例の UTF16 wxString では 8 バイトを消費します。

source: Associates a drop target with this window.
ja: このウィンドウに関連付けられたドロップ先。

source: At last, C++ has a standard string class (std::string).
ja: 最後に、C++ では標準の文字列クラス (std::string) が用意されています。

source: Automatic Deletion of Child Windows
ja: 子ウィンドウの自動削除

source: Automatic scrolling dialogs
ja: ダイアログの自動スクロール

source: Background: The Need for Conversion
ja: 背景: 変換に対する要件

source: Background: The wxString Class
ja: 背景: wxString クラス
